package ru.mai.k806.fatAndThin;

import ru.mai.k806.commons.*;

/**
 *
 */
public class ¬торой“ест_обучение {
	public static void main(String[] args) throws Ќесовпадение–азмерности {

		// ƒостаточное количество примеров дл€ тренировки сети
		// {{вход},{правильный ответ}}
		double[][][] учебныеƒанные = new double[][][]{

				  // »збыточный вес
				  {{140, 90}, {2}},
				  {{150, 90}, {2}},
				  {{150, 110}, {2}},
				  {{150, 130}, {2}},
				  {{160, 90}, {2}},
				  {{160, 110}, {2}},
				  {{160, 130}, {2}},
				  {{170, 100}, {2}},
				  {{170, 120}, {2}},
				  {{170, 150}, {2}},
				  {{180, 120}, {2}},
				  {{180, 150}, {2}},
				  {{190, 130}, {2}},
				  {{190, 140}, {2}},

				  // Ќормальный вес
				  {{140, 50}, {1}},
				  {{140, 30}, {1}},
				  {{150, 30}, {1}},
				  {{150, 60}, {1}},
				  {{150, 70}, {1}},
				  {{160, 50}, {1}},
				  {{160, 70}, {1}},
				  {{170, 90}, {1}},
				  {{170, 50}, {1}},
				  {{170, 70}, {1}},
				  {{180, 70}, {1}},
				  {{190, 70}, {1}},
				  {{200, 80}, {1}},
				  {{200, 100}, {1}},

				  //Ќедостаточный вес
				  {{140, 10}, {0}},
				  {{140, 20}, {0}},
				  {{150, 20}, {0}},
				  {{160, 30}, {0}},
				  {{160, 40}, {0}},
				  {{170, 20}, {0}},
				  {{170, 30}, {0}},
				  {{170, 40}, {0}},
				  {{180, 30}, {0}},
				  {{180, 50}, {0}},
				  {{180, 40}, {0}},
				  {{180, 60}, {0}},
				  {{190, 60}, {0}},
				  {{190, 40}, {0}},
				  {{190, 30}, {0}},
				  {{200, 70}, {0}},
				  {{200, 60}, {0}},
				  {{200, 50}, {0}}
		};

		//
		double[][] тестовыеƒанные = new double[][]{
				  {190, 100},
				  {160, 100},
				  {150, 80},
				  {170, 60},
				  {190, 50},
				  {200, 90}
		};

		// —оздаЄм сеть
		—еть сеть = new —еть();
		сеть.добавить—лой(new —лой(2, 2, new ѕорогова€‘ункци€јктивности()));
		сеть.добавить—лой(new —лой(2, 1, new ѕорогова€‘ункци€јктивности()));
		сеть.установитьЌормуќбучени€(30);

		// Ќачинаем воспитательную работу
		int количествоЁпох = 1000;
		for (int эпоха = 0; эпоха < количествоЁпох; эпоха++)
			for (int номерѕримера = 0; номерѕримера < учебныеƒанные.length; номерѕримера++)
				сеть.тренироватьс€(учебныеƒанные[номерѕримера][0], учебныеƒанные[номерѕримера][1]);

		//сеть.получить—лой(0).установить‘ункциюјктивности(new ѕорогова€‘ункци€јктивности(0,1,0));
		// ѕровер€ем качество образовани€
        for (int i = 0; i < тестовыеƒанные.length; i++) {
            System.out.println("ѕример є" + (i + 1));
            System.out.println("¬ход = " + строка»зћассива(тестовыеƒанные[i]));
            System.out.println("¬ыход = " + строка»зћассива(сеть.получить–езультат(тестовыеƒанные[i])));
            System.out.println();
        }

	}


	private static String строка»зћассива(double[] массив) {
		String результат = "[";
		for (int i = 0; i < массив.length; i++) {
			результат += массив[i];
			if (i < массив.length - 1)
				результат += ", ";
		}
		результат += "]";
		return результат;
	}
}
